martindubois/KMS-Framework/STM32/F373VCTx/Test/startup_stm32F373vctx.s
.word _sdata

.word _edata

.word _sbss

.word _ebss
# 54 "../../Startup/startup_stm32F373vctx.s"
  .section .text.Reset_Handler
  .weak Reset_Handler
  .type Reset_Handler, %function
Reset_Handler:
  ldr r0, =_estack
  mov sp, r0

  bl SystemInit


  ldr r0, =_sdata
  ldr r1, =_edata
  ldr r2, =_sidata
  movs r3, #0
  b LoopCopyDataInit

CopyDataInit:
  ldr r4, [r2, r3]
  str r4, [r0, r3]
  adds r3, r3, #4

LoopCopyDataInit:
  adds r4, r0, r3
  cmp r4, r1
  bcc CopyDataInit


  ldr r2, =_sbss
  ldr r4, =_ebss
  movs r3, #0
  b LoopFillZerobss

FillZerobss:
  str r3, [r2]
  adds r2, r2, #4

LoopFillZerobss:
  cmp r2, r4
  bcc FillZerobss


  bl __libc_init_array

  bl main

LoopForever:
    b LoopForever

  .size Reset_Handler, .-Reset_Handler
# 112 "../../Startup/startup_stm32F373vctx.s"
  .section .text.Default_Handler,"ax",%progbits
Default_Handler:
Infinite_Loop:
  b Infinite_Loop
  .size Default_Handler, .-Default_Handler
# 125 "../../Startup/startup_stm32F373vctx.s"
  .section .isr_vector,"a",%progbits
  .type g_pfnVectors, %object
  .size g_pfnVectors, .-g_pfnVectors

g_pfnVectors:
  .word _estack
  .word Reset_Handler
  .word NMI_Handler
  .word HardFault_Handler
  .word MemManage_Handler
  .word BusFault_Handler
  .word UsageFault_Handler
  .word 0
  .word 0
  .word 0
  .word 0
  .word SVC_Handler
  .word DebugMon_Handler
  .word 0
  .word PendSV_Handler
  .word SysTick_Handler
  .word WWDG_IRQHandler
  .word PVD_IRQHandler
  .word TAMP_IRQHandler
  .word RTC_WKUP_IRQHandler
  .word FLASH_IRQHandler
  .word RCC_IRQHandler
  .word EXTI0_IRQHandler
  .word EXTI1_IRQHandler
  .word EXTI2_TS_IRQHandler
  .word EXTI3_IRQHandler
  .word EXTI4_IRQHandler
  .word DMA1_CH1_IRQHandler
  .word DMA1_CH2_IRQHandler
  .word DMA1_CH3_IRQHandler
  .word DMA1_CH4_IRQHandler
  .word DMA1_CH5_IRQHandler
  .word DMA1_CH6_IRQHandler
  .word DMA1_CH7_IRQHandler
  .word ADC1_IRQHandler
  .word CAN_TX_IRQHandler
  .word CAN_RXD_IRQHandler
  .word CAN_RXI_IRQHandler
  .word CAN_SCE_IRQHandler
  .word EXTI5_9_IRQHandler
  .word TIM15_IRQHandler
  .word TIM16_IRQHandler
  .word TIM17_IRQHandler
  .word TIM18_DAC_IRQHandler
  .word TIM2_IRQHandler
  .word TIM3_IRQHandler
  .word TIM4_IRQHandler
  .word I2C1_EV_IRQHandler
  .word I2C1_ER_IRQHandler
  .word I2C2_EV_IRQHandler
  .word I2C2_ER_IRQHandler
  .word SPI1_IRQHandler
  .word SPI2_IRQHandler
  .word USART1_IRQHandler
  .word USART2_IRQHandler
  .word USART3_IRQHandler
  .word EXTI15_10_IRQHandler
  .word RTC_ALARM_IRQHandler
  .word CEC_IRQHandler
  .word TIM12_IRQHandler
  .word TIM13_IRQHandler
  .word TIM14_IRQHandler
  .word 0
  .word 0
  .word 0
  .word 0
  .word TIM5_IRQHandler
  .word SPI3_IRQHandler
  .word 0
  .word 0
  .word TIM6_DAC1_IRQHandler
  .word TIM7_IRQHandler
  .word DMA2_CH1_IRQHandler
  .word DMA2_CH2_IRQHandler
  .word DMA2_CH3_IRQHandler
  .word DMA2_CH4_IRQHandler
  .word DMA2_CH5_IRQHandler
  .word SDADC1_IRQHandler
  .word SDADC2_IRQHandler
  .word SDADC3_IRQHandler
  .word COMP1_2_IRQHandler
  .word 0
  .word 0
  .word 0
  .word 0
  .word 0
  .word 0
  .word 0
  .word 0
  .word 0
  .word USB_HP_IRQHandler
  .word USB_LP_IRQHandler
  .word USB_WAKEUP_IRQHandler
  .word 0
  .word TIM19_IRQHandler
  .word 0
  .word 0
  .word FPU_IRQHandler
# 237 "../../Startup/startup_stm32F373vctx.s"
 .weak NMI_Handler
 .thumb_set NMI_Handler,Default_Handler

 .weak HardFault_Handler
 .thumb_set HardFault_Handler,Default_Handler

 .weak MemManage_Handler
 .thumb_set MemManage_Handler,Default_Handler

 .weak BusFault_Handler
 .thumb_set BusFault_Handler,Default_Handler

 .weak UsageFault_Handler
 .thumb_set UsageFault_Handler,Default_Handler

 .weak SVC_Handler
 .thumb_set SVC_Handler,Default_Handler

 .weak DebugMon_Handler
 .thumb_set DebugMon_Handler,Default_Handler

 .weak PendSV_Handler
 .thumb_set PendSV_Handler,Default_Handler

 .weak SysTick_Handler
 .thumb_set SysTick_Handler,Default_Handler

 .weak WWDG_IRQHandler
 .thumb_set WWDG_IRQHandler,Default_Handler

 .weak PVD_IRQHandler
 .thumb_set PVD_IRQHandler,Default_Handler

 .weak TAMP_IRQHandler
 .thumb_set TAMP_IRQHandler,Default_Handler

 .weak RTC_WKUP_IRQHandler
 .thumb_set RTC_WKUP_IRQHandler,Default_Handler

 .weak FLASH_IRQHandler
 .thumb_set FLASH_IRQHandler,Default_Handler

 .weak RCC_IRQHandler
 .thumb_set RCC_IRQHandler,Default_Handler

 .weak EXTI0_IRQHandler
 .thumb_set EXTI0_IRQHandler,Default_Handler

 .weak EXTI1_IRQHandler
 .thumb_set EXTI1_IRQHandler,Default_Handler

 .weak EXTI2_TS_IRQHandler
 .thumb_set EXTI2_TS_IRQHandler,Default_Handler

 .weak EXTI3_IRQHandler
 .thumb_set EXTI3_IRQHandler,Default_Handler

 .weak EXTI4_IRQHandler
 .thumb_set EXTI4_IRQHandler,Default_Handler

 .weak DMA1_CH1_IRQHandler
 .thumb_set DMA1_CH1_IRQHandler,Default_Handler

 .weak DMA1_CH2_IRQHandler
 .thumb_set DMA1_CH2_IRQHandler,Default_Handler

 .weak DMA1_CH3_IRQHandler
 .thumb_set DMA1_CH3_IRQHandler,Default_Handler

 .weak DMA1_CH4_IRQHandler
 .thumb_set DMA1_CH4_IRQHandler,Default_Handler

 .weak DMA1_CH5_IRQHandler
 .thumb_set DMA1_CH5_IRQHandler,Default_Handler

 .weak DMA1_CH6_IRQHandler
 .thumb_set DMA1_CH6_IRQHandler,Default_Handler

 .weak DMA1_CH7_IRQHandler
 .thumb_set DMA1_CH7_IRQHandler,Default_Handler

 .weak ADC1_IRQHandler
 .thumb_set ADC1_IRQHandler,Default_Handler

 .weak CAN_TX_IRQHandler
 .thumb_set CAN_TX_IRQHandler,Default_Handler

 .weak CAN_RXD_IRQHandler
 .thumb_set CAN_RXD_IRQHandler,Default_Handler

 .weak CAN_RXI_IRQHandler
 .thumb_set CAN_RXI_IRQHandler,Default_Handler

 .weak CAN_SCE_IRQHandler
 .thumb_set CAN_SCE_IRQHandler,Default_Handler

 .weak EXTI5_9_IRQHandler
 .thumb_set EXTI5_9_IRQHandler,Default_Handler

 .weak TIM15_IRQHandler
 .thumb_set TIM15_IRQHandler,Default_Handler

 .weak TIM16_IRQHandler
 .thumb_set TIM16_IRQHandler,Default_Handler

 .weak TIM17_IRQHandler
 .thumb_set TIM17_IRQHandler,Default_Handler

 .weak TIM18_DAC_IRQHandler
 .thumb_set TIM18_DAC_IRQHandler,Default_Handler

 .weak TIM2_IRQHandler
 .thumb_set TIM2_IRQHandler,Default_Handler

