martindubois/KMS-Framework/STM32/F373VCTx/Test/startup_stm32F373vctx.s
 .weak TIM3_IRQHandler
 .thumb_set TIM3_IRQHandler,Default_Handler

 .weak TIM4_IRQHandler
 .thumb_set TIM4_IRQHandler,Default_Handler

 .weak I2C1_EV_IRQHandler
 .thumb_set I2C1_EV_IRQHandler,Default_Handler

 .weak I2C1_ER_IRQHandler
 .thumb_set I2C1_ER_IRQHandler,Default_Handler

 .weak I2C2_EV_IRQHandler
 .thumb_set I2C2_EV_IRQHandler,Default_Handler

 .weak I2C2_ER_IRQHandler
 .thumb_set I2C2_ER_IRQHandler,Default_Handler

 .weak SPI1_IRQHandler
 .thumb_set SPI1_IRQHandler,Default_Handler

 .weak SPI2_IRQHandler
 .thumb_set SPI2_IRQHandler,Default_Handler

 .weak USART1_IRQHandler
 .thumb_set USART1_IRQHandler,Default_Handler

 .weak USART2_IRQHandler
 .thumb_set USART2_IRQHandler,Default_Handler

 .weak USART3_IRQHandler
 .thumb_set USART3_IRQHandler,Default_Handler

 .weak EXTI15_10_IRQHandler
 .thumb_set EXTI15_10_IRQHandler,Default_Handler

 .weak RTC_ALARM_IRQHandler
 .thumb_set RTC_ALARM_IRQHandler,Default_Handler

 .weak CEC_IRQHandler
 .thumb_set CEC_IRQHandler,Default_Handler

 .weak TIM12_IRQHandler
 .thumb_set TIM12_IRQHandler,Default_Handler

 .weak TIM13_IRQHandler
 .thumb_set TIM13_IRQHandler,Default_Handler

 .weak TIM14_IRQHandler
 .thumb_set TIM14_IRQHandler,Default_Handler

 .weak TIM5_IRQHandler
 .thumb_set TIM5_IRQHandler,Default_Handler

 .weak SPI3_IRQHandler
 .thumb_set SPI3_IRQHandler,Default_Handler

 .weak TIM6_DAC1_IRQHandler
 .thumb_set TIM6_DAC1_IRQHandler,Default_Handler

 .weak TIM7_IRQHandler
 .thumb_set TIM7_IRQHandler,Default_Handler

 .weak DMA2_CH1_IRQHandler
 .thumb_set DMA2_CH1_IRQHandler,Default_Handler

 .weak DMA2_CH2_IRQHandler
 .thumb_set DMA2_CH2_IRQHandler,Default_Handler

 .weak DMA2_CH3_IRQHandler
 .thumb_set DMA2_CH3_IRQHandler,Default_Handler

 .weak DMA2_CH4_IRQHandler
 .thumb_set DMA2_CH4_IRQHandler,Default_Handler

 .weak DMA2_CH5_IRQHandler
 .thumb_set DMA2_CH5_IRQHandler,Default_Handler

 .weak SDADC1_IRQHandler
 .thumb_set SDADC1_IRQHandler,Default_Handler

 .weak SDADC2_IRQHandler
 .thumb_set SDADC2_IRQHandler,Default_Handler

 .weak SDADC3_IRQHandler
 .thumb_set SDADC3_IRQHandler,Default_Handler

 .weak COMP1_2_IRQHandler
 .thumb_set COMP1_2_IRQHandler,Default_Handler

 .weak USB_HP_IRQHandler
 .thumb_set USB_HP_IRQHandler,Default_Handler

 .weak USB_LP_IRQHandler
 .thumb_set USB_LP_IRQHandler,Default_Handler

 .weak USB_WAKEUP_IRQHandler
 .thumb_set USB_WAKEUP_IRQHandler,Default_Handler

 .weak TIM19_IRQHandler
 .thumb_set TIM19_IRQHandler,Default_Handler

 .weak FPU_IRQHandler
 .thumb_set FPU_IRQHandler,Default_Handler

 .weak SystemInit
